var data =
    {
        "allList":[
            {
                "name": "廚具"
            },
            {
                "name": "額外項目"
            },
        ],
        // "title":"桶身選擇與材質",
        "barrel":[
            {
                "name": "上櫃"
            },
            {
                "name": "下櫃"
            },
            {
                "name": "上下櫃"
            },
        ],
        "barrelMaterial":[
            {
                "name": "木桶"
            },
            {
                "name": "白鐵桶"
            },
            {
                "name": "白鐵雙桶"
            },
            {
                "name": "發泡桶"
            },
        ],
        // "title": "檯面選擇與材質",
        "mesa": [
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
        ],
        "mesaMaterial": [
            {
                "name": "無檯面"
            },
            {
                "name": "美耐"
            },
            {
                "name": "不鏽鋼"
            },
            {
                "name": "人造石"
            },
            {
                "name": "人造石(韓)"
            },
            {
                "name": "石英石"
            },
            {
                "name": "矽鋼石"
            },
        ],
        // "title": "門板選擇與材質",
        "plates": [
            {
                "name": ""
            },
            {
                "name": ""
            },
            {
                "name": ""
            },
        ],
        "platesMaterial": [
            {
                "name": "美耐門",
            },
            {
                "name": "水晶門/結晶門",
            },
            {
                "name": "結晶六面",
            },
            {
                "name": "高壓門",
            },
        ],
        //單位
        "unit":[
            {
                "size": "公分"
            },
            {
                "size": "片(門)"
            },
            {
                "size": "式"
            },
            {
                "size": "支"
            },
            {
                "size": "抽"
            },
            {
                "size": "組"
            },
            {
                "size": "台"
            },
            {
                "size": "數片"
            },
        ],
        //額外項目
        "type":[
            {
                "name": "上系統櫥櫃"
            },
            {
                "name": "下系統櫥櫃(含檯面)"
            },
            {
                "name": "電器櫃"
            },
            {
                "name": "冰箱上櫃"
            },
            {
                "name": "冰槽桶身更改"
            },
            {
                "name": "修飾版"
            },
            {
                "name": "檯面加工工資"
            },
            {
                "name": "水槽"
            },
            {
                "name": "水槽加工工資"
            },
            {
                "name": "水龍頭"
            },
            {
                "name": "抽屜"
            },
            {
                "name": "拉籃"
            },
            {
                "name": "側拉籃"
            },
            {
                "name": "緩衝轉角小怪"
            },
            {
                "name": "緩衝高身置物籃"
            },
            {
                "name": "鉸鏈"
            },
            {
                "name": "上/下掀門"
            },
            {
                "name": "把手"
            },
            {
                "name": "瓦斯爐"
            },
            {
                "name": "排油煙機"
            },
            {
                "name": "烘碗機"
            },
            {
                "name": "踢腳"
            },
            {
                "name": "強化烤漆玻璃"
            },
            {
                "name": "安裝費"
            },
            {
                "name": "清運"
            }
        ],
        "testArea":[
            {
                "test": "測試1"
            },
            {
                "test": "測試2"
            },
            {
                "test": "測試3"
            }
        ],
        "all":[
            {
                "name": "自訂"
            },
            {
                "name": "-----廚具-----"
            },
            {
                "name": "上系統櫥櫃"
            },
            {
                "name": "下系統櫥櫃(含檯面)"
            },
            {
                "name": "電器櫃"
            },
            {
                "name": "冰箱上櫃"
            },
            {
                "name": "冰槽桶身更改"
            },
            {
                "name": "修飾版"
            },
            {
                "name": "檯面加工工資"
            },
            {
                "name": "水槽"
            },
            {
                "name": "水槽加工工資"
            },
            {
                "name": "水龍頭"
            },
            {
                "name": "抽屜"
            },
            {
                "name": "拉籃"
            },
            {
                "name": "側拉籃"
            },
            {
                "name": "緩衝轉角小怪"
            },
            {
                "name": "緩衝高身置物籃"
            },
            {
                "name": "鉸鏈"
            },
            {
                "name": "上/下掀門"
            },
            {
                "name": "把手"
            },
            {
                "name": "瓦斯爐"
            },
            {
                "name": "排油煙機"
            },
            {
                "name": "烘碗機"
            },
            {
                "name": "踢腳"
            },
            {
                "name": "強化烤漆玻璃"
            },
            {
                "name": "安裝費"
            },
            {
                "name": "清運"
            }
        ],
    }